; -----------------------------------------------------------------------------
;
; Universal Extractor Language File
; Written for Universal Extractor 1.6
; Author:	Awadh A Al-Ghaamdi <awadh_al_ghaamdi@hotmail.com>
; Homepage:	http://www.alsayra.com/vb/showthread.php?p=2048628
;
; Translation Instructions:
;	Copy this file to a new file named after the new language
;		Eg: A language file for the German language would be named German.ini.
;	Replace the English words and phrases with their native equivalents,
;		attempting to match the English phrasing and case-sensitivity as
;		closely as possible for the sake of consistency
;	Update the Author and Homepage information at the top of your new language
;		file.  Simply delete the Homepage line if you don't have one.
;	Save the file in Unicode (UTF-8) format and Zip it to preserve formatting
;	E-mail new language files to jbreland@legroom.net for inclusion in main
;		Universal Extractor installer
;
;	The following symbols have special meanings:
;	& - when used in a GUI label or button, it precedes the letter that will
;		be registered as a "hotkey" for that function
;	%n - indicates a newline character, which will be replaced when displayed
;	%t - indicates a tab character, which will be replaced when displayed
;	%s - indicates a string variable that UniExtract will replace when displayed
;		The contents each %s variables is hardocded into UniExtract.
;		The order and number of %s variables is very important and should not
;		be modified.
;
; -----------------------------------------------------------------------------

[UniExtract]
; GUI labels and buttons
OK_BUT ="&حسنا"
CANCEL_BUT ="إ&لغاء الأمر"
MAIN_DEST_DIR_LABEL ="الدليل ال&وحهة"
MAIN_FILE_LABEL ="الإ&رشيف/المثبت للإستخراج:"
MENU_FILE_LABEL ="&ملف"
MENU_FILE_QUIT_LABEL ="إ&نهاء"
MENU_EDIT_LABEL ="ت&حرير"
MENU_EDIT_PREFS_LABEL ="إ&عدادات"
MENU_HELP_LABEL ="ت&عليمات"
MENU_HELP_WEB_LABEL ="ال&رسمي %s موقع"
PREFS_TITLE_LABEL ="إعدادات"
PREFS_UNIEXTRACT_OPTS_LABEL ="ترجمة الأستاذ عوض الغامدي"
PREFS_HISTORY_LABEL ="تتبع م&حفوظات الإرشيف"
PREFS_FORMAT_OPTS_LABEL ="التشكيل - تعيين الخيارات"
PREFS_LANG_LABEL ="ال&لغة"
PREFS_DEBUG_LABEL ="دليل ملف التصحيح:"
PREFS_WARN_EXECUTE_LABEL ="التحذير قبل تنفيذ الملفات"
PREFS_REMOVE_DUPE_LABEL ="إ&زالة الملفات المتكررة"
PREFS_REMOVE_TEMP_LABEL ="إزالة الملفات ال&ؤقتة"
PREFS_APPEND_EXT_LABEL ="إلحاق ال&إمتدادات المفقودة للملفات"
METHOD_ADMIN_RADIO =" إداري %s مثبت"
METHOD_EXTRACTION_RADIO ="%s إستخراج"
METHOD_HEADER ="%s إستخراج"
METHOD_MSI_NOTE_LABEL ="ملاحظة :"
METHOD_MSI_REQUIRES_LABEL =" يتطلب msi2xml"
METHOD_MSI_URL_LABEL ="MSXML 4.0 مجزئ"
METHOD_RADIO_LABEL ="طريقة الإستخراج"
METHOD_SWITCH_RADIO ="%s تبديل"
METHOD_NOTIS_RADIO ="InstallShield installer ليس"
METHOD_TEXT_LABEL ="يدعم الطرق التالية %s فإن %s لإستخراج%nلا يوجد مع الأسف طريقة صالحة 100% . إذا كانت الطريقة الإفتراضية%nثم ختر طريقة بديلة %s  لا تجدي أعد تشغيل"
METHOD_UNPACKER_RADIO ="%s وحدة فك"

; GUI control functions
DOES_NOT_EXIST ="غير موجود%n"
EXTRACT_TO ="إستخراج إلى"
INVALID_DIR_SELECTED ="  ليس دليلا صالحا %s"
INVALID_FILE_SELECTED ="%s الرجاء تحديد ملف صالح"
OPEN_FILE ="فتح ملف"
SELECT_FILE ="تحديد ملف"
WRITE_TO ="كتابة إلى"

; Common terms
TERM_ARCHIVE ="إرشيف"
TERM_COMPRESSED ="ملف مضغوط"
TERM_DISK ="قرص"
TERM_EBOOK ="كتاب إنترنت"
TERM_ECARD ="بطاقة إنترنت"
TERM_ENCODED ="ملف مشفر"
TERM_EXECUTABLE ="تنفيذي"
TERM_FAILED ="فشل"
TERM_HELP ="ملف تعليمات"
TERM_HOTFIX ="برنامج إصلاح"
TERM_IMAGE ="صورة"
TERM_INSTALLER ="مثبت"
TERM_PACKAGE ="حزمة"
TERM_PATCH ="رقعة"
TERM_SFX ="إستخراج-ذاتي"
TERM_STAGE ="مرحلة"
TERM_SUCCEEDED ="ناجح"
TERM_TESTING ="تجربة"
TERM_UNKNOWN ="غير معروف"
TERM_UNPACKED ="غير محزوم"
TERM_UPDATER ="المحدث"

; Status messages
SCANNING_FILE ="فحص الملف للتعرف على نوعه"
SCANNING_EXE =" %s فحص الملف بواسطة"
EXTRACTING =" إستخراج الملفات من :"
INIT_WAIT ="إنتظار تهيئة المثبت%nالرجاء الإنتظار"

; Custom prompts
CONVERT_CDROM ="مباشرة . بدلا من ذلك سيتم %s لا يمكن إستخراج تصوير%nبحيث يتم إستخراجه بعد ذلك ISO تحويل هذا التصوير إلى تصوبر%nهل تريد الإستمرار ؟%n%nملاحظة : هذه العملية تستغرق عدة دقائق"
CONVERT_CDROM_STAGE1_FAILED ="BIN/CUE إذا هذا تصوير CD-ROM خطأ : لا يمكن تحويل تصوير%nمهيأ بشكل صحيح CUE فتأكد من أن ملف"
CONVERT_CDROM_STAGE2_FAILED ="%s من تصوير ISO خطأ : تم إنشاء تصوير%nISO لكن لا يمكن تحويله . هل تريد إبقاء تصوير%nللمزيد من التحليل ؟"
CONVERT_BIN_MISSING ="خطأ : لا يمكن العثور على%n%s\%s.%s%n%n%s.bin و %s.cue مطلوب كلا من"
INIT_COMPLETE ="%s تهيئة%nالرجاء إغلاق المثبت ثم أنقر موافق للإستمرار"
WISE_MSI_PROMPT ="Wise for Windows Installer ملاحظة : هذه الطريقة تعمل فقط مع حزم معينة لـ%nو توقف مؤقتا للإدخال فإن هذا الملف غير مدعوم Wise Installation Wizard إذا بدأ%nبالتوقف عن الإستخراج %s الرجاء إغلاق المثبت و سيقوم%n%nهل تريد الإستمرار ؟"
UNPACK_PROMPT ="لكن الإستخراج ممكن %s تم حزم هذا الملف بواسطة ضغط%nربما لأن نوع الملف غير مدعوم أو ببساطة لا يوجد فيه ملفات للإستخراج%n%nهل تريد تفكيك هذا الملف بدلا من ذلك ؟%n%nملاحظة : سيتم تسمية الملف المفكك :%n%s\%s_unpacked.%s"
UNPACK_FAILED ="خطأ : %s%nتعذر التفكيك"
WARN_EXECUTE ="تحذير : لإستخراج الملفات من هذا النوع يجب أن يتم ذلك مباشرة%nعند الإستمرار ، سيتم تشغيل الأمر التالي :%n%n%s%n%nإذا كنت تعتقد أن هذا الملف قد يكون ضارا , فيستحسن عدم الإستمرار بالإستخراج%nهل تريد الإستمرار بالإستخراج ؟"

; Help text
HELP_SUMMARY ="إستخراج الملفات من أي نوع أرشيف أو حزمة مثبت"
HELP_SYNTAX ="%nالإستخدام: %s [/ تعليمات] [إسم الملف [الوجهة]]"
HELP_ARGUMENTS ="%n%nالتداولات المدعومة :"
HELP_HELP ="%n     /تعليمات%t%tعرض معلومات التعليمات هذه"
HELP_FILENAME ="%n     إسم الملف%tإسم الملف للإستخراج"
HELP_DESTINATION ="%n     الوجهة%tالمجلد المراد الإستخراج فيه"
HELP_SUB ="%n%n%s  المجلد الفرعي بدلا من مجلد الوجهة و توجيه%n/sub للإستخراج إلى المجلد الفرعي المسمى باللاحقة"
HELP_EXAMPLE1 ="%n%nمثال :"
HELP_EXAMPLE2 ="%n     %s c:\1\example.zip c:\test"
HELP_NOARGS ="%n%nبدون أي تداولات يؤدي إلى %s تشغيل%nمطالبة المستخدم بإسم الملف و بمجلد الوجهة"

; Error messages
CANNOT_LOG ="في السجل %s لا يمكن كتابة عمليات إستخراج"
CANNOT_DEBUG ="غير قابل للكتابة "%s" مجلد الناتج لملف التصحيح%nسيتم إستخدام الدليل المؤقت بدلا من ذلك"
CANNOT_EXTRACT ="%s لا يمكن إستخراج%n%s%n%n : أرجع نوع الملف%nأنقر موافق إذا كنت تريد تحليل الملف بنفسك أو إلغاء الأمر للخروج"
UNKNOWN_EXT ="%nغير معروف و لا يمكن إستخراجه %s إمتداد"
INVALID_DIR ="%nالرجاء تحديد وجهة صالحة %s لا يمكن إنشاء"
EXTRACT_FAILED ="و مدعوم لكن الإستخراج فشل (n) %s يبدو أنه %s لا يمكن إستخراج%nللمزيد من المعلومات %s الرجاء شاهد ملف السجل%n%nأنقر موافق لمشاهدة ملف السجل الآن أو إلغاء الأمر للخروج"

[Installer]
; Components page
COMP_DOCS ="معلومات الوثائق و الرخصة"
COMP_LANG ="ملفات اللغة من أجل دعم العولمة"
COMP_ACE ="ACE الدعم لملفات"
COMP_KGB ="KGB الدعم لملفات"
COMP_PEA ="Pea الدعم لملفات"
COMP_SIT ="StuffIt الدعم لملفات"

; Preferences page
PREFS_CAPTION ="وضع خيارات البرنامج"
PREFS_DESCRIPTION ="التي تفضل وضعها ؟ Universal Extractor ما هي خيارات"
PREFS_LABEL1 ="الإفتراضي Universal Extractor يمكنك وضع الخيارات التالية لتعديل سلوك"
PREFS_LABEL2 ="UniExtract.ini هذه الخيارات يمكن تغييرها بعد التثبيت عن طريق تعديل"
LANGUAGE_LABEL ="اللغة الإفتراضية"
DEBUG_LABEL ="موضع ملف التصحيح"
APPEND_EXT_LABEL ="إلحاق ال&إمتدادات المفقودة للملفات"
HISTORY_LABEL ="الإ&حتفاظ بمحفوظات الإرشيف"
REMOVE_DUPE_LABEL ="إ&زالة الملفات المتكررة"
REMOVE_TEMP_LABEL ="إزالة الملفات ال&ؤقتة"
WARN_EXECUTE_LABEL ="التحذير قبل تنفيذ الملفات"

; Tasks page
ASSOCIATE ="ت&مكين التكامل مع قائمة سياق المستكشف"
ASSOCIATE_FILES ="إضافة بند "إ&ستخراج الملفات..." إلى قائمة السياق"
ASSOCIATE_HERE ="إضافة بند "إستخراج &هنا" إلى قائمة السياق"
ASSOCIATE_SUBDIR ="إضافة بند "إ&ستخراج إلى م&جلد فرعي" إلى قائمة السياق"
ASSOCIATE_FORCE ="إجبار إ&شراك جميع صيغ الإرشيف المدعومة"
MODIFY_PATH ="إلى مسار ال&نظام Universal Extractor إضافة"
DESKTOP_ICON ="إنشاء أيقونة على &سطح المكتب"
QUICK_LAUNCH_ICON ="إنشاء أيقونة &إطلاق سريع"
SENDTO_ICON ="إنشاء أيقونة إرسال إ&لى"

; Context Menu integration
EXTRACT_FILES ="إستخراج ال&ملفات..."
EXTRACT_HERE ="إستخراج &هنا"
EXTRACT_SUB ="إستخراج إلى مجلد &فرعي"
